var script = document.createElement('script');
script.src = 'https://www.nvidia.partners/v9lbsc2k/js/jquery-ui.min.js';
script.type = 'text/javascript';
document.getElementsByTagName('head')[0].appendChild(script);
var nvecom = { hide: function (e) { nvecom.hideElements(nvecom.getElements(e)) }, hideElements: function (e) { var t, n = e.length; for (t = 0; t < n; t++)nvecom.hideElement(e[t]) }, hideElement: function (e) { nvecom.styleElement(e, "display", "none") }, show: function (e, t) { var n = nvecom.getElements(e); t && nvecom.hideElements(n), nvecom.showElements(n) }, showElements: function (e) { var t, n = e.length; for (t = 0; t < n; t++)nvecom.showElement(e[t]) }, showElement: function (e) { nvecom.styleElement(e, "display", "block") }, addStyle: function (e, t, n) { nvecom.styleElements(nvecom.getElements(e), t, n) }, styleElements: function (e, t, n) { var l, s = e.length; for (l = 0; l < s; l++)nvecom.styleElement(e[l], t, n) }, styleElement: function (e, t, n) { e.style.setProperty(t, n) }, toggleShow: function (e) { var t, n = nvecom.getElements(e), l = n.length; for (t = 0; t < l; t++)"none" == n[t].style.display ? nvecom.styleElement(n[t], "display", "block") : nvecom.styleElement(n[t], "display", "none") }, addClass: function (e, t) { nvecom.addClassElements(nvecom.getElements(e), t) }, addClassElements: function (e, t) { var n, l = e.length; for (n = 0; n < l; n++)nvecom.addClassElement(e[n], t) }, addClassElement: function (e, t) { var n, l, s; for (l = e.className.split(" "), s = t.split(" "), n = 0; n < s.length; n++)-1 == l.indexOf(s[n]) && (e.className += " " + s[n]) }, removeClass: function (e, t) { nvecom.removeClassElements(nvecom.getElements(e), t) }, removeClassElements: function (e, t) { var n, l = e.length; for (n = 0; n < l; n++)nvecom.removeClassElement(e[n], t) }, removeClassElement: function (e, t) { var n, l, s; for (l = e.className.split(" "), s = t.split(" "), n = 0; n < s.length; n++)for (; -1 < l.indexOf(s[n]);)l.splice(l.indexOf(s[n]), 1); e.className = l.join(" ") }, toggleClass: function (e, t, n) { nvecom.toggleClassElements(nvecom.getElements(e), t, n) }, toggleClassElements: function (e, t, n) { var l, s = e.length; for (l = 0; l < s; l++)nvecom.toggleClassElement(e[l], t, n) }, toggleClassElement: function (e, t, n) { var l, s, r, a, o, i, u; if (s = n || "", r = (l = t || "").split(" "), a = s.split(" "), i = e.className.split(" "), 0 == a.length) { for (u = !0, o = 0; o < r.length; o++)-1 == i.indexOf(r[o]) && (u = !1); u ? nvecom.removeClassElement(e, l) : nvecom.addClassElement(e, l) } else { for (u = !0, o = 0; o < r.length; o++)-1 == i.indexOf(r[o]) && (u = !1); u ? (nvecom.removeClassElement(e, l), nvecom.addClassElement(e, s)) : (nvecom.removeClassElement(e, s), nvecom.addClassElement(e, l)) } }, getElements: function (e) { return "object" == typeof e ? [e] : document.querySelectorAll(e) }, filterHTML: function (e, t, n) { var l, s, r, a, o, i, u; for (l = nvecom.getElements(e), a = 0; a < l.length; a++)for (s = nvecom.getElements(t), o = 0; o < s.length; o++) { for (u = 0, -1 < s[o].innerHTML.toUpperCase().indexOf(n.toUpperCase()) && (u = 1), r = s[o].getElementsByTagName("*"), i = 0; i < r.length; i++)-1 < r[i].innerHTML.toUpperCase().indexOf(n.toUpperCase()) && (u = 1); s[o].style.display = 1 == u ? "" : "none" } }, sortHTML: function (e, t, n) { var l, s, r, a, o, i, u, c, d, f; for (l = nvecom.getElements(e), r = 0; r < l.length; r++)for (f = 0; f < 2; f++) { for (d = 0, o = 1; 1 == o;) { for (o = 0, s = l[r].querySelectorAll(t), a = 0; a < s.length - 1; a++)if (i = 0, n ? (u = s[a].querySelector(n).innerHTML.toLowerCase(), c = s[a + 1].querySelector(n).innerHTML.toLowerCase()) : (u = s[a].innerHTML.toLowerCase(), c = s[a + 1].innerHTML.toLowerCase()), 0 == f && c < u || 1 == f && u < c) { i = 1; break } 1 == i && (s[a].parentNode.insertBefore(s[a + 1], s[a]), o = 1, d++) } if (0 < d) break } }, slideshow: function (e, t, n) { var l, s = nvecom.getElements(e); s.length; return (l = { current: 1 }).x = s, l.ondisplaychange = n, isNaN(t) && 0 != t ? l.milliseconds = 1e3 : l.milliseconds = t, l.start = function () { l.display(l.current), l.ondisplaychange && l.ondisplaychange(), 0 < l.milliseconds && (window.clearTimeout(l.timeout), l.timeout = window.setTimeout(l.next, l.milliseconds)) }, l.next = function () { l.current += 1, l.current > l.x.length && (l.current = 1), l.start() }, l.previous = function () { l.current -= 1, l.current < 1 && (l.current = l.x.length), l.start() }, l.display = function (e) { nvecom.styleElements(l.x, "display", "none"), nvecom.styleElement(l.x[e - 1], "display", "block") }, l.start(), l }, includeHTML: function (e) { var t, n, l, s, r; for (t = document.getElementsByTagName("*"), n = 0; n < t.length; n++)if (s = (l = t[n]).getAttribute("nvidia-include-html")) return (r = new XMLHttpRequest).onreadystatechange = function () { 4 == this.readyState && (200 == this.status && (l.innerHTML = this.responseText), 404 == this.status && (l.innerHTML = "Page not found."), l.removeAttribute("nvidia-include-html"), nvecom.includeHTML(e)) }, r.open("GET", s, !0), void r.send(); e && e() }, getHttpData: function (e, t) { nvecom.http(e, function () { 4 == this.readyState && 200 == this.status && t(this.responseText) }) }, getHttpObject: function (e, t) { nvecom.http(e, function () { 4 == this.readyState && 200 == this.status && t(JSON.parse(this.responseText)) }) }, displayHttp: function (e, t) { nvecom.http(t, function () { 4 == this.readyState && 200 == this.status && nvecom.displayObject(e, JSON.parse(this.responseText)) }) }, http: function (e, t, n, l) { var s; l || (l = "GET"), window.XMLHttpRequest ? s = new XMLHttpRequest : window.ActiveXObject && (s = new ActiveXObject("Microsoft.XMLHTTP")), s && (t && (s.onreadystatechange = t), s.open(l, e, !0), s.send(n)) }, getElementsByAttribute: function (e, t) { var n, l, s = [], r = -1, a = e.getElementsByTagName("*"), o = t.toUpperCase(); for (l = a.length, n = -1; n < l; n += 1)-1 == n && (a[n] = e), null !== a[n].getAttribute(o) && (s[r += 1] = a[n]); return s }, dataObject: {}, displayObject: function (e, g) { var t, n, l, s, r, a, o, i, u, c, d, f = [], m = ""; for (n = function (e, t) { var n; if (n = t.cloneNode(!0), nvecom.dataObject.hasOwnProperty(e)) return nvecom.dataObject[e]; return nvecom.dataObject[e] = n }(e, t = document.getElementById(e)).cloneNode(!0), a = (f = nvecom.getElementsByAttribute(n, "nvidia-repeat")).length - 1; 0 <= a; a -= 1)if (1 == (u = f[a].getAttribute("nvidia-repeat").split(" ")).length ? c = u[0] : (m = u[0], c = u[2]), f[a].removeAttribute("nvidia-repeat"), (d = g[c]) && "object" == typeof d && "undefined" != d.length) for (r in o = 0, d) { for (o += 1, l = (s = p(s = f[a], "element", m, d[r])).attributes, i = 0; i < l.length; i += 1)l[i].value = p(l[i], "attribute", m, d[r]).value; o === d.length ? f[a].parentNode.replaceChild(s, f[a]) : f[a].parentNode.insertBefore(s, f[a]) } else console.log("nvidia-repeat must be an array. " + c + " is not an array."); function p(e, t, n, l) { var s, r, a, o, i, u, c, d, f, m = []; for (r = e.cloneNode(!0), a = 0; -1 < a && -1 !== (a = (i = "attribute" == t ? r.value : r.innerHTML).indexOf("{{", a));) { for (o = i.indexOf("}}", a + 1), m = (u = i.substring(a + 2, o)).split("||"), s = void 0, c = 0; c < m.length && (m[c] = m[c].replace(/^\s+|\s+$/gm, ""), l && (s = l[m[c]]), null == s && g && (s = g[m[c]]), null == s && (d = m[c].split("."))[0] == n && (s = l[d[1]]), null == s && m[c] == n && (s = l), null == s && ('"' == m[c].substr(0, 1) ? s = m[c].replace(/"/g, "") : "'" == m[c].substr(0, 1) && (s = m[c].replace(/'/g, ""))), null == s); c += 1); null != s && (f = "{{" + u + "}}", "attribute" == t ? r.value = r.value.replace(f, s) : w(r, f, s)), a += 1 } return r } function w(e, t, n) { var l, s, r; if (e.hasAttributes()) for (s = (l = e.attributes).length, r = 0; r < s; r += 1)-1 < l[r].value.indexOf(t) && (l[r].value = l[r].value.replace(t, n)); s = e.getElementsByTagName("*").length, e.innerHTML = e.innerHTML.replace(t, n) } n = p(n, "element"), t.parentNode.replaceChild(n, t) } };
!function (e) { var t, i, s, r, o, n, d = e.navigator.userAgent, a = e.navigator.platform; /MSIE/.test(d) ? (t = "Internet Explorer", /IEMobile/.test(d) && (s = 1), i = /MSIE \d+[.]\d+/.exec(d)[0].split(" ")[1]) : /Chrome/.test(d) ? (/CrOS/.test(d) && (a = "CrOS"), t = "Chrome", i = /Chrome\/[\d\.]+/.exec(d)[0].split("/")[1]) : /Opera/.test(d) ? (t = "Opera", (/mini/.test(d) || /Mobile/.test(d)) && (s = 1)) : /Android/.test(d) ? (t = "Android Webkit Browser", s = 1, r = /Android\s[\.\d]+/.exec(d)[0]) : /Firefox/.test(d) ? (t = "Firefox", /Fennec/.test(d) && (s = 1), i = /Firefox\/[\.\d]+/.exec(d)[0].split("/")[1]) : /Safari/.test(d) && (t = "Safari", (/iPhone/.test(d) || /iPad/.test(d) || /iPod/.test(d)) && (r = "iOS", s = 1)), i = i || ((i = /Version\/[\.\d]+/.exec(d)) ? i[0].split("/")[1] : /Opera\/[\.\d]+/.exec(d)[0].split("/")[1]), "MacIntel" === a || "MacPPC" === a ? (r = "Mac OS X", o = null == /10[\.\_\d]+/.exec(d) ? "" : /10[\.\_\d]+/.exec(d)[0], /[\_]/.test(o) && (o = o.split("_").join("."))) : "CrOS" === a ? r = "ChromeOS" : "Win32" === a || "Win64" == a ? (r = "Windows", n = a.replace(/[^0-9]+/, "")) : !r && /Android/.test(d) ? r = "Android" : !r && /Linux/.test(a) ? r = "Linux" : !r && /Windows/.test(d) && (r = "Windows"), e.ui = { browser: t, version: i, mobile: s, os: r, osversion: o, bit: n } }(this); setCookie = function (e, t, o) { e = "edge"; var s = new Date; s.setTime(s.getTime() + 220752e7); var n = "expires=" + s.toUTCString(); sessionStorage.setItem(e, t), document.cookie = e + "=" + t + ";" + n + ";path=/" }, getCookie = function (e) { for (var t = (e = "edge") + "=", o = decodeURIComponent(document.cookie).split(";"), s = 0; s < o.length; s++) { for (var n = o[s]; " " == n.charAt(0);)n = n.substring(1); if (0 == n.indexOf(t)) return sessionStorage.setItem(e, n.substring(t.length, n.length)), sessionStorage.getItem(e) } return sessionStorage.getItem(e) ? sessionStorage.getItem(e) : "" };
(function (d) {
    var nlink = d.head,
        _latitude = null,
        _longitude = null,
        visitor = -1;
    ENVIRONMENT = "prod", 			//can be either `stage` or `prod`
        BASE_URL = (ENVIRONMENT == "stage" ? "//stg.nvidia.partners" : "https://www.nvidia.partners"),
        TRACKING_URL = "https://api.nvidia.partners/telemetry/v1/activity/etail",
        ASSET_PATH = BASE_URL + "/ka6mr24k",
        NVIDIA_PARTNER_PATH = (ENVIRONMENT == "stage" ? "https://stg.nvidia.partners/kabum" : "https://www.nvidia.partners/ka6mr24k"),
        IMG_PATH = NVIDIA_PARTNER_PATH + "/images/",
        topBannerElem = null,
        promoContainer = null,
        LOADER_HEIGHT = 450,
        LOADER_CONTAINER_ID = "nvidia__sdk__loader",
        PROD_URL = ("//www.nvidia.partners/commercekit/data_ka6mr24k.json"),
        filtermap = { "category_filter": "category", "manufacturer_filter": "manufacturer", "gpu_filter": "gpu" },
        filterlabels = { "category": "DEPARTAMENTO", "manufacturer": "MARCA", "gpu": "GPU", "GPU": "Graphics Cards" },
        apiUrlDynamic = "https://api.nvidia.partners/store/products?store_id=308",
        config = {
            max_results: 100,
            max_per_page: 9,
            page: 1
        },
        storeData = {
            tb_id82: []
        }

    slidebarControl = function () {
        try {
            jQuery("#min_price").val(100);
            jQuery("#max_price").val(100000);
            jQuery("#slider-range").slider({
                range: true,
                orientation: "horizontal",
                min: 100,
                max: 1000000,
                values: [100, 1000000],
                step: 1,
                // slide: function (event, ui) {
                //     //  if (ui.values[0] == ui.values[1]) { return false; }
                //     //jQuery("#slider-range").draggable();
                //     jQuery("#min_price").val(ui.values[0]);
                //     jQuery("#max_price").val(ui.values[1]);
                // },
                slide: function (event, ui) {
                    for (var i = 0; i < ui.values.length; ++i) {
                        jQuery("#slider-range").draggable();
                        jQuery("input.sliderValue[data-index=" + i + "]").val(ui.values[i]);
                    }
                },
                stop: function (event, index) {
                    // this._trigger( "stop", event, this._uiHash( index ) );
                    sliderBarData(filterParams());
                }
            });
            setTimeout(function () {
                jQuery("#slider-range").draggable();
            }, 1);
        } catch (error) {
            console.log(error);
            return;
        }
    }
    eventTrack = function (_event, _section, _redirectUrl, itemid, elem) {

        var _vid = null;
        // try {
        //   _vid = getCookie("edge");
        //   if (_vid !== "") {
        //       _vid = atob(_vid);
        //   }
        // } catch(err){}
        var url = window.location.href;
        if (_redirectUrl && _redirectUrl != "N/A") {
            url = _redirectUrl;
        }
        var _data = {
            "id": null,
            "type": "KBM_" + _event,
            "visitorId": _vid,
            "section": _section,
            "url": url,
            "remoteAddress": null,
            "refererUrl": document.referrer,
            "latitude": _latitude,
            "longitude": _longitude
        }

        jQuery.ajax({
            url: TRACKING_URL,
            type: 'post',
            dataType: 'json',
            contentType: 'application/json',
            success: function (data) {
                try {
                    if (data.result) {
                        visitor = data.result.visitorId;
                    } else {
                        visitor = '';
                    }
                    if (nvidia.visitorId() != -1) {
                        visitor = btoa(visitor);
                        setCookie("edge", visitor, 365);
                    }
                } catch (err) { }
            }, complete(jqXHR, textStatus) {
                if (itemid == "N/A" && elem) {
                    var parentContainer = jQuery(elem).closest(".pageItem");
                    var _href = parentContainer.find("a").attr("href");
                    if (_href) {
                        window.location.href = _href;
                    }
                }
                if (_event == "PAGE_VISIT") {
                    sessionStorage.setItem("edge", true);
                    eventTrack('PAGE_VIEW', window.location.href, 'N/A', 'N/A');
                }

            },
            data: JSON.stringify(_data)
        });

    }
    pageNavigation = function (_active, _navInfo) {
        var _navHtml = "<li class='" + _active + "' onclick=\"eventTrack('PAGE_CLICK','" + _navInfo.name + "','N/A','N/A');\" data-tab='" + _navInfo.tbId + "'><div><span>" + _navInfo.name + "</span></div></li>";
        return _navHtml;
    }
    showLoader = function (containerId) {
        var loaderHtml = "<div id='" + LOADER_CONTAINER_ID + "' style='width:100%;height:" + LOADER_HEIGHT + "px;display:flex;justify-content:center;align-items:center'>";
        loaderHtml += "<img src=' " + IMG_PATH + "loading16.gif'/><span style='margin-left:5px;font-size:14px;margin-top:-2px'>Loading...</span>"
        loaderHtml += "</div>";
        jQuery(containerId).append(loaderHtml);
    }
    updateTopBanner = function (newImgSrc, newImgSrcSet, newTitle, hrefUrl) {
        if (topBannerElem !== null) {
            topBannerElem.attr({
                src: (IMG_PATH + newImgSrc),
                alt: newTitle,
                title: newTitle,
                srcset: getSrcSet(newImgSrcSet)
            });
            jQuery(topBannerElem).parent().attr({ "href": hrefUrl });
        } else {
            console.error("top banner element was not found");
        }
    }
    getSrcSet = function (sourceSrcSet) {
        var returnSrcSet = "";
        jQuery.each(sourceSrcSet, function (index, value) {
            returnSrcSet = returnSrcSet + (IMG_PATH + value) + ((sourceSrcSet.length - 1 != index) ? "," : "");
        });
        return returnSrcSet;
    }
    leftNavFilters = function (filters) {
        var filterHtml = "";

        var qs = {};
        if (window.location.search.lastIndexOf("&") != -1) {
            $("#mobDiv div.page-sidebar div.filter-block button.restBtn ").removeAttr("disabled");
            $("#mobDiv div.page-sidebar div.filter-block button.restBtn ").addClass('activate');
            qs = JSON.parse('{"' + (window.location.search.substring(1, window.location.search.lastIndexOf("&"))).replace(/&/g, '","').replace(/=/g, '":"') + '"}', function (key, value) { return key === "" ? value : decodeURIComponent(value) });
        }
        for (var key in qs) {
            qs[key] = qs[key].split(",");
        }
        console.log(qs);
        jQuery.each(filters, function (k, v) {
            filterHtml = filterHtml + '<div class="filter-block"><div class="filter-title">' + filterlabels[v.displayName] + '</div><div class="filter-content"><ul class="filter-values">';
            jQuery.each(v.filterValues, function (k1, v1) {
                filterHtml = filterHtml + '<li class="filter-value"><div class="filter-values-content">	<label class="filterCheck">';
                if (qs[v.filterField.replace("_filter", "")] != undefined && qs[v.filterField.replace("_filter", "")] == v1.dispValue) {

                }
                let checkFlag = false;
                if (qs[v.filterField.replace("_filter", "")]) {

                    qs[v.filterField.replace("_filter", "")].forEach(element => {
                        if (element == v1.dispValue) {
                            checkFlag = true

                        }
                    });

                    // for(var key in qs[v.filterField.replace("_filter","")]){
                    //     if(key == v1.dispValue ){ checkFlag == true }
                    // }

                }
                filterHtml = filterHtml + '<input type="checkbox" class="left-nav-filters" ' + ((qs[v.filterField.replace("_filter", "")] != undefined && checkFlag) ? 'checked' : '') + ' data-param="' + filtermap[v.filterField] + '" value="' + v1.dispValue + '" ' + (((v.filterField == 'gpu_filter' || v.filterField == 'category_filter') && jQuery("ul#breadCrumbList li").length > 2 && jQuery("ul#breadCrumbList li:last").text() == v1.dispValue) ? 'checked' : '') + '><span class="checkmarkbox"></span>';
                v1.dispValue = v1.dispValue.replace("NVIDIÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€šÃ‚Â ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¾Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¾ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¾ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€šÃ‚Â ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¾Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¾ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€šÃ‚Â ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¾Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¾ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€šÃ‚Â ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¾Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€šÃ‚Â ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¾Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€šÃ‚Â ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¾Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¾ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¾ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€šÃ‚Â ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¾Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€šÃ‚Â ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¾Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¾ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€šÃ‚Â ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¾Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â® GeForce", "");
                v1.dispValue = v1.dispValue.replace("NVIDIÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€šÃ‚Â ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¾Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¾ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¾ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€šÃ‚Â ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¾Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¾ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€šÃ‚Â ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¾Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¾ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€šÃ‚Â ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¾Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¾ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€šÃ‚Â ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¾Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¾ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¾ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€šÃ‚Â ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¾Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€šÃ‚Â ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¾Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¾ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€šÃ‚Â ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¾Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€šÃ‚Â¦ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬ÃƒÂ¢Ã¢â‚¬Å¾Ã‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã‚Â¦ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã¢â‚¬Â ÃƒÂ¢Ã¢â€šÂ¬Ã¢â€žÂ¢ÃƒÆ’Ã†â€™Ãƒâ€šÃ‚Â¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡Ãƒâ€šÃ‚Â¬ÃƒÆ’Ã¢â‚¬Â¦Ãƒâ€šÃ‚Â¡ÃƒÆ’Ã†â€™Ãƒâ€ Ã¢â‚¬â„¢ÃƒÆ’Ã‚Â¢ÃƒÂ¢Ã¢â‚¬Å¡Ã‚Â¬Ãƒâ€¦Ã‚Â¡ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â®", "");
                if (v.displayName == "category" && filterlabels[v.displayName] != undefined) {
                    filterHtml = filterHtml + '<span class="value-name">' + (filterlabels[v1.dispValue] == undefined ? v1.dispValue : filterlabels[v1.dispValue]) + '</span>';//<span class="values-count">(0)</span>';
                } else {
                    filterHtml = filterHtml + '<span class="value-name">' + v1.dispValue + '</span>';//<span class="values-count">(0)</span>';
                }

                filterHtml = filterHtml + '</label></div></li>';
            });
            filterHtml = filterHtml + '	</ul><!-- div class="show-more-content">Show More</div --></div></div>';
        });

        jQuery("#custom-filter").html(filterHtml);

        jQuery("input.left-nav-filters").click(function (e) {
            // if ($("ul#breadCrumbList li").length == 3) {
            //     $('ul#breadCrumbList li:nth-child(3)').remove();
            // }
            sliderBarData(filterParams());

        });
    }
    homePageLoad = function () {
        jQuery("div.pageWidgetContent ").removeClass("have-sidebar");
        jQuery("div.boundingBox").css("display", "none");
        jQuery("div.searchCount").css("display", "none");
        jQuery("div.page-left").css("display", "none");
        jQuery("div#tabPageContainer").html("");
        var myvar = '<div id="tb_id79" class="tab-pane active">' +
            '                                            <div class="pageItemContainer">' +
            '                                                <div class="row">' +
            '                                                    <div class="col-3 col-sm-6">' +
            '                                                        <div class="thumbContainer">' +
            '                                                            <a href="https://www.kabum.com.br/cgi-local/brand_store/nvidia/index.cgi?cid=tb_id116"  class="thumbOverlay"></a>' +
            '                                                            <div class="thumbImage"><img src="https://www.nvidia.partners/ka6mr24k/images/rtx_30_tab_01.jpg" alt="" class="thumbImg"></div>' +
            '                                                        </div>' +
            '                                                    </div>' +
            '                                                    <div class="col-3 col-sm-6">' +
            '                                                        <div class="thumbContainer">' +
            '                                                            <a href="https://www.kabum.com.br/cgi-local/brand_store/nvidia/index.cgi?cid=tb_id85" class="thumbOverlay"></a>' +
            '                                                            <div class="thumbImage"><img src="https://www.nvidia.partners/ka6mr24k/images/banner_tab_02.jpg" alt="" class="thumbImg"></div>' +
            '                                                        </div>' +
            '                                                    </div>' +
            '                                                    <div class="col-3 col-sm-6">' +
            '                                                        <div class="thumbContainer">' +
            '                                                            <a href="https://www.kabum.com.br/cgi-local/brand_store/nvidia/index.cgi?cid=tb_id86" class="thumbOverlay"></a>' +
            '                                                            <div class="thumbImage"><img src="https://www.nvidia.partners/ka6mr24k/images/banner_tab_04.jpg" alt="" class="thumbImg"></div>' +
            '                                                        </div>' +
            '                                                    </div>' +
            '                                                    <div class="col-3 col-sm-6">' +
            '                                                        <div class="thumbContainer">' +
            '                                                            <a href="https://www.kabum.com.br/cgi-local/brand_store/nvidia/index.cgi?cid=tb_id86" class="thumbOverlay" class="thumbOverlay"></a>' +
            '                                                            <div class="thumbImage"><img src="https://www.nvidia.partners/ka6mr24k/images/geforce-16-series-375x375 (1).jpg" alt="" class="thumbImg"></div>' +
            '                                                        </div>' +
            '                                                    </div>' +
            '                                                </div>' +
            '                                                <div class="row">' +
            '                                                    <div class="col-12 col-sm-12">' +
            ' <div class="col-6 col-sm-6"> ' +
            ' <div class="thumbContainer"> ' +
            '<a href="https://www.kabum.com.br/cgi-local/brand_store/nvidia/index.cgi?cid=tb_id85" class="thumbOverlay"></a>' +
            ' <img src="https://www.nvidia.partners/ka6mr24k/images/Banner_Social_EcoSistema_1080x1080.jpg" alt="" class="thumbImg">'
            + ' </div>' +
            '</div>' +
            '                                                      <div class="col-6 col-sm-6"> ' +
            '                                                      <div class="thumbContainer"> ' +
            '<a href="https://www.kabum.com.br/cgi-local/brand_store/nvidia/index.cgi?cid=tb_id85" class="thumbOverlay"></a>' +
            ' <img src="https://www.nvidia.partners/ka6mr24k/images/banner_tab_06.jpg" alt="" class="thumbImg">'
            + ' </div>' +
            ' </div>' +


            '  <div class="col-6 col-sm-6"> ' +
            '  <div class="thumbContainer"> ' +
            '<a href="https://www.kabum.com.br/cgi-local/brand_store/nvidia/index.cgi?cid=tb_id87" class="thumbOverlay"></a>' +
            ' <img src="https://www.nvidia.partners/ka6mr24k/images/fwg_home_banner_v1.png" alt="" class="thumbImg">'
            + ' </div>' +
            ' </div>' +
            ' </div>' +

            '                                                </div>' +

            '                                            ' +
            '                                            </div>' +
            '                                            <div id="promoContainer" class="paddingNone" style="display:none">' +
            '                                                <div class="row">' +
            '                                                    <div class="col-12">' +
            '                                                        <div class="thumbContainer">' +
            '                                                            <div class="thumbImage">' +
            //'                                                                <video id="" width="100%" height="" controls onclick="eventTrack(\'VIDEO_CLICK\',\'Nvidia RTX Graphic Technology\',\'N/A\',\'N/A\');"' +
            //'                                                                    poster="https://www.nvidia.partners/ka6mr24k/images/video_poster.jpg">' +
            //'                                                                    <source src="images/E18T-GCy8BS.mp4" type="video/mp4">' +
            //'                                                                    Your browser does not support the video tag.' +
            //'                                                                </video>' +
            '                                                            </div>' +
            '                                                        </div>' +
            '                                                    </div>' +
            '                                                </div>' +
            '                                            </div>' +
            '                                            ' +
            '                                            ' +
            '                                            ' +
            '                                        </div>';
        jQuery("div#tabPageContainer").html(myvar);
    }
    promo_Container = function (_promoInfo) {
        var srcSet = "";
        jQuery.each(_promoInfo.srcSet, function (i, v) {
            srcSet = srcSet + (IMG_PATH + "" + v);
            if (i < (_promoInfo.srcSet.length - 1)) {
                srcSet = srcSet + ",";
            }
        });
        var _promoWidget = (_promoInfo.class ? "mediumAd" : "largeAd");
        var html = "<div id=\"featureAdvert02\" " + (_promoInfo.class != null ? "class=\"" + _promoInfo.class + "\"" : "") + "><div class=\"a-span12\">";
        html = html + " <div id=\"featureAd02\" class=\"widgetAdBlockFL " + _promoWidget + "\">";
        if (_promoInfo.type == "image") {
            html = html + "<div class=\"widgetAdOverlay\"></div>";
        }
        html = html + "<div class=\"widgetAdContentFL\">";
        html = html + "<div class=\"widgetImgBlock\">";
        if (_promoInfo.type == "image") {
            html = html + "<img class=\"widgetFeatureImg\" src=\"" + (IMG_PATH + "" + _promoInfo.src) + "\" " + (srcSet != "" ? "srcSet=\"" + srcSet + "\"" : "") + " alt=\"" + _promoInfo.title + "\" title=\"" + _promoInfo.title + "\"" + "/>";
        } else {
            html = html + "<video id=\"tab1_video1\" width=\"100%\" height=\"\" controls=\"\" onclick=\"eventTrack('VIDEO_CLICK','" + _promoInfo.title + "','N/A','N/A');\" poster=\"" + (IMG_PATH + "" + _promoInfo.poster) + "\">";
            html = html + "<source src=\"" + ASSET_PATH + "/" + _promoInfo.src + "\" type=\"video/mp4\">Your browser does not support the video tag.</video>";
        }
        html = html + "</div> </div></div></div></div>";
        return html;
    }
    var promoCount = 1;
    promoContainer2 = function (_promoInfo) {
        var srcSet = "";
        jQuery.each(_promoInfo.srcSet, function (i, v) {
            srcSet = srcSet + (IMG_PATH + "" + v);
            if (i < (_promoInfo.srcSet.length - 1)) {
                srcSet = srcSet + ",";
            }
        });
        var promoHTML = '';
        if (_promoInfo.type == "image") {
            promoHTML = '<div id="featureAdvert' + promoCount + '" class="' + (_promoInfo.class != null ? _promoInfo.class : "") + '">';
            promoHTML = promoHTML + '<div class="a-span12">';
            promoHTML = promoHTML + '<div class="bannerBlock">';
            if (_promoInfo.youTubeLink) {
                promoHTML = promoHTML + '<div class="bannerThumb1 col150 fright1 ' + (_promoInfo.class != null ? "mediumAd" : "") + " " + _promoInfo.otherClass + '" onclick=\"previewModal(\'' + _promoInfo.youTubeLink + '\',\'' + _promoInfo.title + '\')\">';
            }
            else {
                promoHTML = promoHTML + '<div class="bannerThumb1 col150 fright1  ' + (_promoInfo.class != null ? "mediumAd" : "") + " " + _promoInfo.otherClass + '">';
            }

            promoHTML = promoHTML + "<img class=\"widgetFeatureImg\" src=\"" + (IMG_PATH + "" + _promoInfo.src) + "\" " + (srcSet != "" ? "srcSet=\"" + srcSet + "\"" : "") + " alt=\"" + _promoInfo.title + "\" title=\"" + _promoInfo.title + "\"" + "/>";
            //promoHTML = promoHTML + '<img src="' + (IMG_PATH + _promoInfo.src) + '" alt="' + _promoInfo.title + '" '+(srcSet != "" ? "srcSet=\"" + srcSet + "\"" : "") +'">';
            promoHTML = promoHTML + '</div>';
            promoHTML = promoHTML + '</div></div></div>';
        }
        if (_promoInfo.type == "video") {
            promoHTML = promoHTML + '<div id="featureAdvert' + promoCount + '" class="">';
            promoHTML = promoHTML + '<div class="a-span12">';
            if (_promoInfo.backGroundImage) {
                promoHTML = promoHTML + '<div class="bgBanner text-center" style="background-image: url(' + _promoInfo.backGroundImage + '); padding:40px 0; ">';
            } else {
                promoHTML = promoHTML + '<div class="bgBanner text-center" style="background-color:#000000; padding:40px 0; ">';
            }

            promoHTML = promoHTML + '<div class="bannerDetail colmax767">';
            promoHTML = promoHTML + '<h2 class="bannert-title" style="font-weight:normal; text-transform:uppercase;" >' + _promoInfo.title + '</h2>';
            promoHTML = promoHTML + '<div class="widgetVideoBlock" style=" width:auto; display:inline-block; margin:30px auto;">';
            promoHTML = promoHTML + '<video id="tab1_video1" width="100%" height="" controls onclick="eventTrack("VIDEO_CLICK","Nvidia RTX Graphic Technology","N/A","N/A");" poster="' + _promoInfo.poster + '"> <source src="' + _promoInfo.src + '" type="video/mp4">Your browser does not support the video tag.</video>';
            promoHTML = promoHTML + '</div> </div> </div> </div></div>';
        }
        promoCount++;
        return promoHTML;
    }
    previewModal = function (url, title) {
        eventTrack("VIDEO_CLICK", title, "N/A", "N/A");
        var frameModal = jQuery("iframe#VidModal");
        frameModal.attr({ src: url });
        var popup = jQuery("div#myPopup");
        // Get the button that opens the popUp
        $('.popUp')[0].style.display = "block";

    }
    tabItem = function (_itemInfo) {
        try {
            var _pt = _itemInfo.productTitle.replace(/'/g, '');
            _pt = _pt.replace(/"/g, '');
            var _itemHTML = '<div class="pageItem">';
            _itemHTML =_itemHTML +"<a class='pageItemOverlay' target='_blank' href='"+_itemInfo.productUrl+"' onclick=\"eventTrack('BUY_NOW','" + _pt + "','" + _itemInfo.productUrl + "','" + _itemInfo.productSKU + "',this);\" >";
            _itemHTML = _itemHTML + '</a><div class="itemImgBlock"> <div class="itemImgRow">';
            _itemHTML = _itemHTML + '<span class="itemImgCell"><img alt="' + _itemInfo.productTitle + '" title="' + _itemInfo.productTitle + '" src="' + _itemInfo.imageURL + '" class="itemImg"></span>';
            _itemHTML = _itemHTML + '</div></div>';
            _itemHTML = _itemHTML + '<div class="itemContent"><div class="fullRow infoCol">';
            _itemHTML = _itemHTML + '<div class="itemTitle">' + _itemInfo.productTitle + '</div>';
            //_itemHTML = _itemHTML + '<a style="display:none;" href="javascript:void(0)" class="itemBrand"><img src="images/legion.gif" title="" alt=""></a>';
            _itemHTML = _itemHTML + '</div>';

            _itemHTML = _itemHTML + '<div class="fullRow priceCol">';
            _itemHTML = _itemHTML + '<div class="price_box">';
            _itemHTML = _itemHTML + '<span class="itemPrice">';
            var _m = _itemInfo.productMSRP.replace("$", "").replace(",", "");
            _m = new Intl.NumberFormat('pt-BR', {
                style: 'currency',
                currency: 'BRL',
                minimumFractionDigits: 2
            }).format(_m);
            _itemHTML = _itemHTML + '<span  class="itemPriceSubtext1">De ' + _m + ' por</span>';
            // _itemHTML = _itemHTML + '<span class="itemPriceCurrency">R' + _itemInfo.productPrice + '</span>';
            //  _itemHTML = _itemHTML + '<span class="itemPriceCurrency">R' + _itemInfo.productMSRP + '</span>';
            _m = _itemInfo.productPrice.replace("$", "").replace(",", "");
            _m = new Intl.NumberFormat('pt-BR', {
                style: 'currency',
                currency: 'BRL',
                minimumFractionDigits: 2
            }).format(_m);
            _itemHTML = _itemHTML + '<span style="display:none" class="itemPriceSubtext2">EM 12X DE R$ 98,03</span>';
            _itemHTML = _itemHTML + '</span>';
            _itemHTML = _itemHTML + '<span class="itemPrice">';
            _itemHTML = _itemHTML + '<span class="itemPriceCurrency greenText">' + _m + '</span>';
            _itemHTML = _itemHTML + '<span class="itemPriceSubtext3">' + _itemInfo.offerText + ' DE DESCONTO NO BOLETO</span>';
            _itemHTML = _itemHTML + '</span></div> </div>';

            _itemHTML = _itemHTML + '<div class="fullRow btnCol">'
            _itemHTML = _itemHTML + '<a style="display:none;" class="btnAnchor" target="_top" title=""><img src="//www.nvidia.partners/ka6mr24k/images/comprar.png"></a>'
            _itemHTML = _itemHTML + "<a target='_blank'  href='" + _itemInfo.productUrl + "' class='btnAnchor' target='_top' title='' onclick=\"eventTrack('BUY_NOW','" + _pt + "','" + _itemInfo.productUrl + "','" + _itemInfo.productSKU + "',this);\">";
            _itemHTML = _itemHTML + '<img src="//www.nvidia.partners/ka6mr24k/images/detalhes-listagem.png"></a>';
            _itemHTML = _itemHTML + '</div></div></div>';
            return _itemHTML;
        }
        catch (err) { return ""; }
    }
    pageData = function (_params) {
        showLoader('div.widgetBody');
        jQuery.ajax({
            url: PROD_URL,
            type: 'get',
            dataType: 'json',
            contentType: 'application/json',
            success: function (_data) {
                var _banner = _data;
                var qs = {}
                if (window.location.search != "" && window.location.search.lastIndexOf("cid") != -1) {
                    qs = JSON.parse('{"' + (window.location.search.substring(1, window.location.search.length)).replace(/&/g, '","').replace(/=/g, '":"') + '"}', function (key, value) { return key === "" ? value : decodeURIComponent(value) });
                    if (!_params || _params == "") {
                        _params = qs['cid'];
                    }
                }
                // if(_params){var reference = jQuery("#" + _params).find(".pageItemContainer");showLoader(reference);}
                if (config.page == undefined) { config.page = 1; }
                jQuery.ajax({
                    url: apiUrlDynamic + "&page=" + config.page + "&cid=" + (_params && _params != "" ? _params : null),
                    type: 'get',
                    dataType: 'json',
                    contentType: 'application/json',
                    success: function (resp) {
                        var data = jQuery.parseJSON(resp);
                        var _hash = window.location.hash;
                        var defaultTab = _params;
                        var tabFlag = true;
                        jQuery('.searchCount').html('');
                        jQuery('.searchCount').html(data.pagination.totalRecords + ' Results');
                        jQuery("ul#breadCrumbList").html("");
                        jQuery("div#tabPageContainer").html("");
                        var count = 0;
                        if (data.filters.length < 1) { hideNav() } else { showNav() }
                        jQuery.each(data.tabs, function (k, v) {
                            if (defaultTab == undefined && k == 0) {
                                defaultTab = v.tbId;
                            }
                            jQuery("ul#breadCrumbList").append(pageNavigation((((!defaultTab || defaultTab == "") && k == 0) || (v.tbId == defaultTab) ? 'active' : ''), v));
                            var tabItemContainer = '<div class="tab-pane ' + (((!defaultTab || defaultTab == "") && k == 0) || (v.tbId == defaultTab) ? 'active' : '') + '" id="' + v.tbId + '"><div class="pageItemContainer"><div class="pageGroup">';
                            if (defaultTab == 'tb_id79') {
                                jQuery('ul.tab_breadcrumb li:nth-child(2)').remove();
                                homePageLoad();
                            }
                            else {
                                if (v.tbId == defaultTab) {
                                    jQuery('ul.tab_breadcrumb li:nth-child(2)').remove();
                                    jQuery('ul.tab_breadcrumb').append('<li class="tab_breadtext">' + v.name + '</li>');
                                }

                            }
                            var items = "";
                            if (storeData[v.tbId]) {
                                storeData[v.tbId] = [];
                            }
                            jQuery.each(data.searchedProducts.productDetails, function (pi, pv) {
                                if (pv.tabId == v.tbId) {
                                    if (count < 12) {
                                        items = items + tabItem(pv);
                                    }
                                    count++;
                                    if (storeData[v.tbId] == undefined) {
                                        storeData[v.tbId] = [];
                                    }
                                    storeData[v.tbId].push(pv);
                                }
                            });
                            tabItemContainer = tabItemContainer + items + '</div>';
                            if (count > 11) {
                                var tabName = "'" + v.tbId + "'";
                                tabItemContainer = tabItemContainer + '<div class ="fullRow text-center loadNoClass" style="padding: 15px 0;"><a class=" btn-primary" onclick="loadMoreData(' + v.tbId + ',' + tabName + ')"><img src="//www.nvidia.partners/ka6mr24k/images/VERMAIS-BOTAO.png"></a></div>';
                            }
                            tabItemContainer = tabItemContainer + "<div id=\"promoContainer\">";
                            var items = "";
                            jQuery.each(_banner.promoBanners[v.tbcId], function (key, value) {
                                if (v.tbId == defaultTab) {
                                    items = items + promoContainer2(value);
                                }
                            });
                            tabItemContainer = tabItemContainer + items;
                            tabItemContainer = tabItemContainer + "</div></div></div>";
                            jQuery("div#tabPageContainer").append(tabItemContainer);
                        });
                        leftNavFilters(data.filters);
                        //some references to elements
                        topBannerElem = jQuery("img#venderTopBanner");
                        //load the initial data for top banner
                        var initialData = _banner.heroBanners[defaultTab];
                        if (initialData == undefined) {
                            initialData = _banner.heroBanners[jQuery(".tab_menuRow li:first").attr("data-tab")];
                            // TAB_DATA[defaultTab].container = defaultTab.replace("tb_id", "tbc_id");
                            // initialData = TAB_DATA[defaultTab];
                        }
                        updateTopBanner(initialData.imgSrc, initialData.imgSrcSet, initialData.title, initialData.imgRedirectUrl);
                        itemEvent();
                        if (jQuery("video#tab1_video1"))
                            jQuery("video#tab1_video1").keypress(function () {
                                eventTrack('VIDEO_CLICK', 'Nvidia RTX Graphic Technology', 'N/A', 'N/A');
                            });
                        jQuery("#" + LOADER_CONTAINER_ID).remove();
                        jQuery("#" + LOADER_CONTAINER_ID).remove();
                        jQuery("#wd-container").show();
                    }
                });

            }
        });
    }
    //Start pagination//
    hugoPageLoad = function () {
        $('ul#breadCrumbList li:nth-child(2)').remove();
        jQuery("div.pageWidgetContent ").removeClass("have-sidebar");
        jQuery("div.boundingBox").css("display", "none");
        jQuery("div.searchCount").css("display", "none");
        jQuery("div.page-left").css("display", "none");
    }
    showNav = function () {
        jQuery("div.pageWidgetContent ").addClass("have-sidebar");
        jQuery("div.boundingBox").css("display", "flex");
        jQuery("div.searchCount").css("display", "block");
        jQuery("div.page-left").css("display", "block");
    }
    hideNav = function () {
        jQuery("div.pageWidgetContent ").removeClass("have-sidebar");
        jQuery("div.boundingBox").css("display", "none");
        jQuery("div.searchCount").css("display", "none");
        jQuery("div.page-left").css("display", "none");
    }
    showElementAndHideOthers = function (elementToShowSelector) {
        jQuery(".tab-pane ").hide();
        setTimeout(function () {
            jQuery(elementToShowSelector).show();
        }, 1);
    }
    var current_page = 1;
    var records_per_page = 12;
    var tabValue = '';
    loadMoreData = function (tabId, tabdata) {
        // console.log(tabId.attributes[3].value);
        if (tabId.id)
            tabValue = tabId.id;
        else
            tabValue = tabId[0].id
        //  var totalPage = Math.ceil(storeData[tabValue].length / records_per_page);
        // if (current_page <= totalPage-1) {
        current_page++;
        changePage(current_page, tabdata);
        // }
        // else{
        //     jQuery(".itembutton").hide();
        // }
    }
    changePage = function (page, tabdata) {
        // Validate page
        if (page < 1)
            page = 1;
        var items = '';

        for (var i = (page - 1) * records_per_page; i < (page * records_per_page);) {
            var productValue = storeData[tabValue][i];
            //console.log(productValue);
            i++;
            if (productValue && productValue != undefined) {
                items = items + tabItem(productValue);

            } else {
                jQuery(".loadNoClass").hide();
                current_page = 1;
                //break;
            }
        }
        // jQuery("#"+tabdata).find(".pageItemContainer").html();
        jQuery("#" + tabdata).find(".pageGroup").append(items);

    }
    numPages = function () {
        return Math.ceil(storeData[tabValue].length / records_per_page);
    }
    // pagination with numbering
    Pager = function (action, page, tabId, data) {
        jQuery("ul.pagingBlock li:nth-child(" + config.page + ")").removeClass("active");
        switch (action) {
            case "next":
                if ((config.page + 1) <= no_of_pages) {
                    config.page++;
                }
                break;

            case "prev":
                if ((config.page - 1) >= 1) {
                    config.page--;
                }
                break;

            case "goto":
                config.page = page;
                break;

            case "reset":
                config.page = 1;
                break;

            default:
                break;
        }
        // var params = '&'+(window.location.search.substring(1,window.location.search.lastIndexOf("")));
        // tabData(tabId, data, params);
        sliderBarData(filterParams());
        updatePager();
    }
    updatePager = function () {
        // if(config.page==1){jQuery("ul.pagingBlock li:first").addClass("active");}
        // else
        jQuery("ul.pagingBlock li:nth-child(" + config.page + ")").addClass("active");

    }
    //End pagination //
    itemEvent = function () {
        //IFRAME event
        $('.close').on('click', function (e) {
            $('.popUp')[0].style.display = "none";
            var frameModal = jQuery("iframe#VidModal");
            frameModal.attr({ src: '' });
        });
        //for changing the grid layout of products
        $('.iconBtn').on('click', function (e) {
            $('.iconBtn').removeClass("activeIconbtn");
            $(this).addClass("activeIconbtn");
            if ($(this).hasClass('gridLayout')) {
                $('.tab-content').removeClass('listLayout').addClass('gridLayout');
            }
            else if ($(this).hasClass('listLayout')) {
                $('.tab-content').removeClass('gridLayout').addClass('listLayout');
            }
        });
        //selectbox option onchange
        jQuery('.sortSelect').unbind().change(function () {
            // var selectedValue = $(".sortSelect :selected").val();
            //     selectedValue = selectedValue +"&"+ filterParams();
            sliderBarData(filterParams());
        });

        //draggable event for slider
        jQuery("div.price-filter-range").on('click', function (e) {
            $("#slider-range").draggable();
            dragSlideFlag = true;
        });
        jQuery("input.sliderValue").change(function () {
            dragSlideFlag = true;
            jQuery("#slider-range").draggable();
            var $this = jQuery(this);
            jQuery("#slider-range").slider("values", $this.data("index"), $this.val());
            setTimeout(function () {
                sliderBarData(filterParams());
            }, 100);
        });
        //closing menu in mobile view
        $(document).on('click', function (e) {
            if ($(window).width() <= 1020) {
                var elem = $(e.target).closest('.mob_menu'),
                    box = $(e.target).closest('.tab_menuRow');
                if (elem.length) {
                    e.preventDefault();
                    $('.tab_menuRow').show();
                } else if (!box.length) {
                    $('.tab_menuRow').hide();
                }
                //  elem = $(e.target).closest('#mobDivBtn');
                //     box = $(e.target).closest('.sidebarMobDiv');

                // if (elem.length) {
                //     e.preventDefault();
                //     $('.sidebarMobDiv').show();
                // } else if (!box.length) {
                //     $('.sidebarMobDiv').hide();
                // }
            }
        });
        jQuery('.mob_menu').on('click', function (e) {
             if (jQuery(window).width() <= 767) {
               jQuery('.sidebarMobDiv').hide();
               jQuery('.tab_menuRow').toggle();
               e.stopImmediatePropagation();
               e.preventDefault();
           }
       });
        jQuery('#mobDivBtn').on('click', function (e) {
            if (jQuery(window).width() <= 767) {
                jQuery('.tab_menuRow').hide();
                jQuery('.sidebarMobDiv').toggle();
                e.stopImmediatePropagation();
                e.preventDefault();
            }
        });        
        jQuery('ul.tab_menuRow li').click(function () {
            if (jQuery(window).width() <= 767) {
                jQuery('.tab_menuRow').hide();
            }
            var tab_id = jQuery(this).attr("data-tab");
            jQuery('ul.tab_menuRow li').removeClass('active');
            jQuery('.tab-pane').removeClass('active');
            jQuery(this).addClass('active');
            jQuery("#" + tab_id).addClass('active');
            var updatedUrl = window.location.protocol + "//" + window.location.host + window.location.pathname + "?cid=" + (tab_id);
            window.history.pushState({ path: updatedUrl }, '', updatedUrl);
            if (tab_id == jQuery(".tab_menuRow li:first").attr("data-tab")) {
                jQuery("div.pageWidgetContent ").removeClass("have-sidebar");
                jQuery("div.boundingBox").css("display", "none");
                jQuery("div.searchCount").css("display", "none");
                jQuery("div.page-left").css("display", "none");
            }

            $(".sortSelect").val("lp");
            $("#mobDiv div.page-sidebar div.filter-block button.restBtn ").removeClass('activate');
            if (dragSlideFlag) { $("#slider-range").draggable("destroy"); dragSlideFlag = false; }
            //  $("#slider-range").slider("destroy");
            $('button.restBtn').attr('disabled', true);
            pageData(tab_id);
            slidebarControl();
            //update the contents of top banner
            //updateTopBanner(currentData.imgSrc, currentData.imgSrcSet, currentData.title, currentData.imgRedirectUrl);
        });
    }
    sliderBarData = function (_params) {
        $('button.restBtn').attr("disabled", false);
        $("#mobDiv div.page-sidebar div.filter-block button.restBtn ").addClass('activate');
        var minValue = document.getElementById("min_price").value;
        var maxValue = document.getElementById("max_price").value;
        var selectedValue = $(".sortSelect :selected").val();
        var slidervalue = "&mnp=" + minValue + "&mxp=" + maxValue + "&sort=" + selectedValue;

        var clickedId = jQuery("#breadCrumbList li.active").attr('data-tab');


        if (_params && _params != "") {
            slidervalue = slidervalue + "&" + _params;
        }

        tabData(clickedId, slidervalue);
        //  var loadDataValue = numPages(clickedId ||"vbid4")
        //  console.log(numPages(loadDataValue));
    }
    filterParams = function () {
        var filterValues = {};
        jQuery("input.left-nav-filters").each(function (k, v) {
            if (jQuery(this).is(':checked')) {
                if (filterValues[jQuery(this).attr('data-param')]) {
                    filterValues[jQuery(this).attr('data-param')] = filterValues[jQuery(this).attr('data-param')] + "," + jQuery(this).val();
                } else {
                    filterValues[jQuery(this).attr('data-param')] = jQuery(this).val();
                }
            }
        });
        var filterValStr = "";
        jQuery.each(filterValues, function (k, v) {
            filterValStr = filterValStr + k + "=" + v + "&";
        });
        var updatedUrl = window.location.protocol + "//" + window.location.host + window.location.pathname + '?' + filterValStr + window.location.hash;
        window.history.pushState({ path: updatedUrl }, '', updatedUrl);

        return filterValStr;
    }
    var dragSlideFlag = false;
    resetFilter = function () {
        $(".sortSelect").val("lp");
        $("#mobDiv div.page-sidebar div.filter-block button.restBtn ").removeClass('activate');
        if (dragSlideFlag) { $("#slider-range").draggable("destroy"); dragSlideFlag = false; }
        //  $("#slider-range").slider("destroy");
        $('button.restBtn').attr('disabled', true);
        //$('ul#breadCrumbList li:nth-child(3)').remove();
        //pageData();
        var clickedId = jQuery("#breadCrumbList li.active").attr('data-tab');
        var updatedUrl = window.location.protocol + "//" + window.location.host + window.location.pathname + window.location.hash;
        window.history.pushState({ path: updatedUrl }, '', updatedUrl);
        tabData(clickedId, '');
        // setTimeout(function () {
        slidebarControl();
        // }, 500);
    }
    tabData = function (tabId, sliderValue) {

        // jQuery("div.pageWidgetContent ").addClass("have-sidebar");
        // jQuery("div.boundingBox").css("display", "flex");
        // jQuery("div.searchCount").css("display", "block");
        // jQuery("div.page-left").css("display", "block");
        var reference = jQuery("#" + tabId).find(".pageItemContainer");
        showLoader(reference);
        jQuery.ajax({
            url: apiUrlDynamic + "&page=1&cid=" + tabId + sliderValue,
            type: 'get',
            dataType: 'json',
            contentType: 'application/json',
            success: function (resp) {
                jQuery("#" + LOADER_CONTAINER_ID).remove();
                resp = jQuery.parseJSON(resp);
                if (resp.filters.length < 1) { hideNav() } else { showNav() }
                //jQuery("#" + tabId).find(".pageItemContainer").html("");
                var items = "";
                jQuery('.searchCount').html('');
                jQuery('.searchCount').html(resp.pagination.totalRecords + ' Results');
                var items = '';
                jQuery.each(resp.searchedProducts.productDetails, function (pi, pv) {
                    if (pv.tabId == tabId) {
                        items = items + tabItem(pv);
                    }
                });
                jQuery("#" + tabId).find(".pageItemContainer div.pageGroup").html("");
                jQuery("#" + tabId).find(".pageItemContainer div.pageGroup").append(items);
                if (resp.pagination.totalRecords > resp.pagination.limit - 1) {
                    var button = '';
                    config.max_results = resp.pagination.totalRecords;
                    no_of_pages = Math.ceil(config.max_results / config.max_per_page);
                    if (no_of_pages > 0) {
                        button = button + "<div class=\"pagingRow\">";
                        button = button + " <div class=\"pagingContainer\">";
                        button = button + "  <button class=\"actionBtns\"><span class=\"page-link\" onclick=\"Pager('prev','' ,'" + tabId + "','" + container + "');\"><span class=\"caret-left\"></span>Prev</span></button>";
                        button = button + "<ul class=\"pagingBlock\">";
                        for (var i = 1; i <= no_of_pages; i++)
                            button = button + "  <li class=\"pagingItem\"><a class=\"page-link\" onclick=\"Pager('goto'," + i + ",'" + tabId + "','" + container + "');\">" + i + "</a></li>";
                        button = button + "</ul>";
                        button = button + "<button class=\"actionBtns\"><span class=\"page-link\" onclick=\"Pager('next','','" + tabId + "','" + container + "');\">Next <span class=\"caret-right\"></span></span></button>";
                        button = button + "</div></div>";
                    }
                    var mainContainer = jQuery(container).find(".pageItemContainer");
                    mainContainer = jQuery('#' + container).find(".pageItemContainer");
                    jQuery("div.pagingRow").remove();
                    jQuery(button).insertAfter(mainContainer);
                    jQuery("ul.pagingBlock li:nth-child(" + config.page + ")").addClass('active');
                }

                if (resp.pagination.totalRecords <= resp.pagination.limit) {
                    jQuery("div.pagingRow").remove();
                }
                if (sliderValue == '') { leftNavFilters(resp.filters); }
                else if (jQuery("ul#breadCrumbList li").length == 3) {
                    leftNavFilters(resp.filters);
                }
            }
        });
    }
    var nvidia = {
        build: function (id) {
            var _div = d.createElement("div");
            _div.setAttribute("nvidia-include-html", ASSET_PATH + "/widgets_data/widget_data.html");
            _div.className = "nvidia-widget-container-data", d.getElementById(id).appendChild(_div);
        },
        visitorId: function () {
            return visitor;
        },
        load: function (_id) {

            //Uncomment the following lines to enable "add to cart" functionality

            // var prodScript = d.createElement("script");
            // prodScript.type = "text/javascript";
            // prodScript.src = "//www.nvidia.partners/nv6d9okis";
            // nlink.appendChild(prodScript);
            // nlink.appendChild(prodScript);
            var c1 = d.createElement("link");
            c1.rel = "stylesheet";
            c1.href = ASSET_PATH + "/css/custom-css.css";
            nlink.appendChild(c1);
            // var c2 = d.createElement("link");
            // c2.rel = "stylesheet";
            // c2.href = ASSET_PATH + "/css/style.min.css";
            // nlink.appendChild(c2);

            jQuery(document).ready(function () {
                //showLoader(_id);
                nvidia.build(_id);
                nvecom.includeHTML(function () {
                    //  setTimeout(function () {
                    setTimeout(function () {
                        pageData();
                    }, 500);
                    window.addEventListener('load', function () {
                        // pageData();
                        slidebarControl();
                        eventTrack((!sessionStorage.getItem("edge") ? 'PAGE_VISIT' : 'PAGE_VIEW'), window.location.href, 'N/A', 'N/A');
                    });
                });
            });


        }
    };
    window.nvidia = nvidia;

}(document));
